app/controllers/colours_controller.rb

  def index
    @colours = Colour.paginate(:page => params[:page],
                               :order => 'updated_at DESC')
---
SELECT * FROM "colours" ORDER BY updated_at DESC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "colours"

  def show
    @colour = Colour.find(params[:id])
---
SELECT * FROM "colours" WHERE ("colours"."id" = 1)