app/controllers/palettes_controller.rb

  def index
    @palettes = Palette.paginate(:page => params[:page],
                                 :order => 'updated_at DESC')
---
SELECT * FROM "palettes" ORDER BY updated_at DESC LIMIT 24 OFFSET 0
SELECT count(*) AS count_all FROM "palettes"

  def show
    @palette = Palette.find(params[:id])
---
SELECT * FROM "palettes" WHERE ("palettes"."id" = 0)