app/controllers/sources_controller.rb

SELECT * FROM "sources"
---
  def index
    @sources = Source.all

SELECT * FROM "sources" WHERE ("sources"."id" = 1)
---
  def show
    @source = Source.find(params[:id])